{
  "data": {
    "id": 1,
    "urutan_surah": 1,
    "nama_surah": "Al-Fatihah",
    "jumlah_ayat": 7,
    "tempat_turun": "Mekah",
    "arti": "Pembukaan",
    "sinopsis": "Surah Al-Fatihah merupakan surah pertama dalam Al-Quran yang diturunkan secara lengkap dan termasuk dalam golongan surah Makkiyyah. Surah ini juga dikenali dengan nama-nama lain seperti Ummul Quran (Induk Al-Quran), Ummul Kitab (Induk Kitab), al-Sab'u al-Mathani (Tujuh Ayat Yang Berulang-ulang), al-Hamd (Pujian), as-Salah (Doa), ar-Ruqyah (Jampi), al-Syifa (Penawar), dan al-Waqiah (Pelindung). Surah ini mengandungi tujuh ayat yang merangkumi pujian kepada Allah SWT, pengakuan terhadap keesaan-Nya, dan permohonan petunjuk ke jalan yang lurus. Ia dibuka dengan Basmallah yang menekankan sifat Rahman dan Rahim Allah, diikuti dengan pujian kepada Allah sebagai Rabb al-Alamin, Pemilik Hari Pembalasan, dan diakhiri dengan permohonan hamba agar ditunjukkan jalan orang-orang yang diberi nikmat, bukan jalan mereka yang dimurkai dan yang sesat. Surah ini merupakan rukun dalam solat dan wajib dibaca dalam setiap rakaat. Tanpa membaca Al-Fatihah, solat dianggap tidak sempurna berdasarkan hadith Nabi SAW.",
    "asbab_turun": "Menurut riwayat dari Ibn Abbas radhiallahu 'anhu, Surah Al-Fatihah diturunkan sebagai kurniaan khas kepada Nabi Muhammad SAW dan umatnya. Diriwayatkan bahawa para malaikat datang menghampiri Rasulullah SAW dan berkata: 'Aku datang memberikan khabar gembira dengan membawa dua cahaya yang belum pernah diberikan kepada para Nabi sebelum engkau, iaitu Fatihatul Kitab (Al-Fatihah) dan ayat-ayat terakhir daripada Surah Al-Baqarah. Tidaklah engkau membaca satu huruf daripadanya kecuali ia akan diberikan kepadamu.' Surah ini diturunkan di Mekah dan terdapat riwayat yang menyatakan ia diturunkan sebanyak dua kali, sekali di Mekah dan sekali di Madinah. Ia merupakan surah kelima yang diturunkan setelah permulaan Surah Al-Alaq, Al-Qalam, Al-Muzzammil dan permulaan Surah Al-Muddaththir. Surah ini diturunkan secara lengkap keseluruhan tujuh ayatnya sebagai pembukaan dan asas kepada seluruh kandungan Al-Quran.",
    "ibrah": "Surah Al-Fatihah mengandungi pengajaran dan ibrah yang sangat mendalam untuk umat Islam. Pertama, ia mengajar konsep tauhid yang murni dengan menegaskan bahawa hanya Allah sahaja yang berhak disembah dan hanya kepada-Nya kita memohon pertolongan, sebagaimana terkandung dalam ayat 'Iyyaka na'budu wa iyyaka nasta'in'. Kedua, surah ini mengajar kita untuk sentiasa bersyukur dengan memuji Allah sebagai Rabb al-Alamin yang memelihara dan menjaga seluruh alam. Ketiga, ia menekankan kepentingan memohon petunjuk kepada jalan yang lurus (sirat al-mustaqim) dalam setiap aspek kehidupan, iaitu jalan Islam yang berpandukan Al-Quran, As-Sunnah, dan teladan para salafussoleh. Keempat, surah ini mengajar konsep tawakkal dengan mengakui bahawa hanya Allah yang berkuasa membantu kita. Kelima, ia mengandungi amaran untuk mengelak daripada mengikuti jalan orang-orang yang dimurkai Allah dan yang sesat. Keenam, Al-Fatihah merupakan doa yang mustajab dan penawar bagi penyakit fizikal dan rohani berdasarkan hadith sahih. Ketujuh, ia mengajar adab berdoa yang betul dengan memulakan pujian kepada Allah sebelum memohon hajat. Rahsia Al-Fatihah terletak pada ayat kelima yang menafikan segala bentuk syirik dan menafikan segala kuasa makhluk, menjadikan ia asas kepada seluruh ajaran Al-Quran."
  }
}
