{
  "data": {
    "id": 1,
    "urutan_surah": 1,
    "nama_surah": "Al-Fatihah",
    "senarai_nabi_yang_disebut_dalam_surah_ini": null,
    "jumlah_ayat": 7,
    "tempat_turun": "Makkiyyah",
    "arti": "Pembukaan; surah yang membuka al-Quran dan merumuskan asas akidah, ibadah serta doa hamba kepada Tuhannya.",
    "sinopsis": "Surah Al-Fatihah terdiri daripada tujuh ayat dan merupakan surah pembukaan al-Quran yang wajib dibaca dalam setiap rakaat solat fardhu dan sunat. Majoriti ulama menyatakan ia adalah surah Makkiyyah yang diturunkan sebelum hijrah sebagai pembukaan Kitab Allah dan sebagai doa hidayah untuk umat Nabi Muhammad. Kandungan surah ini bermula dengan pujian kepada Allah, pengakuan tentang rububiyyah dan rahmat-Nya, serta pengiktirafan bahawa Dia sahaja Pemilik hari pembalasan. Ia menghimpunkan pengakuan ubudiyyah dan permohonan pertolongan hanya kepada Allah, diikuti doa agar dikurniakan hidayah ke jalan yang lurus, iaitu jalan orang yang diberi nikmat, bukan jalan mereka yang dimurkai dan mereka yang sesat. Ulama tafsir menerangkan bahawa makna-makna besar al-Quran tentang akidah, ibadah, janji dan ancaman, serta kisah umat terdahulu kembali dan diringkaskan dalam surah yang agung ini.",
    "ibrah": "1. Tauhid dan kebergantungan kepada Allah: Surah ini mengajar bahawa segala pujian, ibadah dan permohonan pertolongan hanya layak ditujukan kepada Allah, sekaligus membersihkan hati daripada segala bentuk syirik sama ada besar atau kecil. 2. Yakin kepada hari akhirat: Sebutan tentang Allah sebagai Pemilik hari pembalasan mendidik hati supaya yakin kepada kehidupan selepas mati, berhati-hati dalam setiap amal dan tidak tertipu dengan dunia yang sementara. 3. Adab berdoa dan beribadah: Susunan ayat menunjukkan adab berdoa iaitu memulakan dengan pujian dan pengagungan kepada Allah, kemudian mengakui ubudiyyah dan keperluan kepada-Nya, barulah memohon hidayah dan segala kebaikan. 4. Kepentingan hidayah yang berterusan: Permintaan \"tunjukilah kami jalan yang lurus\" menunjukkan bahawa seorang mukmin sentiasa memerlukan hidayah Allah pada setiap masa, walaupun telah beriman dan beramal soleh. 5. Mencontohi golongan yang diberi nikmat dan menjauhi jalan yang sesat: Surah ini mengajar agar meneladani para nabi, siddiqin, syuhada’ dan salihin yang mendapat nikmat Allah, serta menjauhi sifat orang yang dimurkai (yang mengetahui kebenaran tetapi tidak mengamalkannya) dan orang yang sesat (yang beramal tanpa ilmu yang sahih)."
  }
}
