{
  "data": {
    "id": 3,
    "urutan_surah": 3,
    "nama_surah": "Al-Imran",
    "senarai_nabi_yang_disebut_dalam_surah_ini": "Nabi Adam, Nabi Nuh, Nabi Ibrahim, Nabi Musa, Nabi Isa, Nabi Zakariyya, Nabi Muhammad",
    "jumlah_ayat": 200,
    "tempat_turun": "Madinah",
    "arti": "Surah ini dinamakan 'Al-Imran' yang bermaksud 'Keluarga Imran'. Ia memuatkan kisah-kisah tentang keluarga Imran, terutamanya kisah kelahiran Nabi Isa dan ibundanya, Maryam binti Imran. Surah Al-Imran dan Surah Al-Baqarah dipanggil 'Az-Zahrawain' (Dua yang Bercahaya) kerana kedua-duanya menyingkap perkara-perkara penting yang disembunyikan oleh Ahli Kitab, seperti kedatangan Nabi Muhammad dan kelahiran Nabi Isa.",
    "sinopsis": "Surah Al-Imran diturunkan di Madinah dan mengandungi pelbagai tema penting dalam Islam. Tema utama surah ini ialah penjelasan tentang penyelewengan agama oleh orang-orang Nasrani (Kristian) dan ajakan kepada mereka untuk kembali ke jalan yang benar.\n\nSurah ini membincangkan beberapa perkara penting:\n\n1. Keimanan dan Ketauhidan: Menjelaskan dalil-dalil yang membantah keyakinan orang-orang Nasrani yang mempertuhankan Nabi Isa. Allah menegaskan bahawa Dia adalah Tuhan yang satu dan tidak ada sekutu bagi-Nya.\n\n2. Kisah Keluarga Imran: Menceritakan tentang doa ibu Imran memohon keturunan yang soleh, kelahiran Maryam, dan keistimewaan Maryam sebagai seorang wanita terpilih.\n\n3. Kabar Gembira Kelahiran Nabi Isa: Menjelaskan tentang kehidupan Nabi Isa, persamaannya dengan Nabi Adam dalam penciptaan, risalahnya, dan mukjizat-mukjizatnya.\n\n4. Peristiwa Bersejarah: Menceritakan tentang Perang Badar dan Perang Uhud, serta pelajaran-pelajaran berharga yang boleh dipetik daripadanya.\n\n5. Ajaran Hukum Islam: Membincangkan tentang pentingnya musyawarah, larangan melakukan riba, dan pengharaman makanan tertentu kepada Bani Israil.\n\n6. Seruan kepada Ahli Kitab: Mengajak orang-orang Yahudi dan Nasrani untuk kembali ke pangkal jalan dan menerima kebenaran Islam.\n\n7. Persatuan Umat Islam: Menekankan pentingnya persatuan dan mengingat manfaat mengingat Allah serta merenungkan ciptaannya.",
    "ibrah": "Surah Al-Imran menyampaikan pelajaran-pelajaran yang amat berharga bagi kehidupan seharian umat Islam:\n\n1. Kebergantungan Kepada Allah: Setiap rezeki, kehidupan, dan kematian adalah dalam tangan Allah. Kita harus menyerahkan sepenuh hati kepada Yang Maha Hidup dan Maha Berdiri Sendiri.\n\n2. Kekuatan Doa dan Kesabaran: Cerita tentang ibu Imran yang berdoa dengan tulus, Nabi Zakariyya yang tekun berdoa, dan Maryam yang sabar mengajar bahawa doa yang ikhlas dan kesabaran akan mendapat ganjaran.\n\n3. Kesatuan Umat Islam: Surah ini mengajak umat Islam untuk tetap bersatu di bawah naungan Al-Quran dan Sunnah Rasulullah. Perpecahan adalah jalan menuju kekalahan, manakala persatuan membawa kemenangan.\n\n4. Pengajaran dari Peperangan Uhud: Setiap kegagalan atau ujian adalah peluang untuk menguji keimanan dan kesabaran. Allah tidak meninggalkan hambanya, tetapi kesabaran dan ketaatan diperlukan untuk mendapat pertolongan-Nya.\n\n5. Hidup dengan Kesyukuran: Allah menjanjikan balasan indah kepada mereka yang bersyukur. Walaupun menghadapi ujian, bersyukurlah kerana syukur membawa keberkatan.\n\n6. Kepemimpinan yang Lemah Lembut: Contoh Nabi Muhammad dalam menangani kegagalan pengikutnya menunjukkan kepentingan pemimpin yang pemaaf, lemah lembut, dan sentiasa bermusyuarat dengan rakyatnya.\n\n7. Merenung Tanda-tanda Allah: Dalam setiap perubahan alam semesta, siang dan malam, terdapat tanda kebesaran Allah. Umat Islam harus merenung dan mengambil iktibar dari ciptaan Allah.\n\n8. Tawakal Kepada Allah: Setelah membuat keputusan dengan matang dan konsultasi, kita harus menyerahkan sepenuhnya kepada Allah dengan penuh keyakinan bahawa Allah adalah sebaik-baik pengurus."
  }
}
