{
  "working_experiences": [
    {
      "duration": "June 2016 – September 2016",
      "job_title": "Intership as Communication Designer",
      "company": "Intellectual Property Corporation of Malaysia (MyIPO)",
      "activities": [
        "Responsible for designing every event poster, posting it on social media, and printing it out.",
        "Responsible for making sure every morning the officer gets the news about intellectual property (prepared the related news for them).",
        "Responsible for redesigning the UI and UX official website.",
        "Attending weekly and monthly meetings to give reports and to make sure to communicate with each other team members in the department."
      ],
      "achievements": [
        "Successfully redesigned MyIPO's new website using WordPress and Custom PHP Code and approved by top officers."
      ],
      "tech_stack_used": [
        "WordPress",
        "PHP",
        "HTML",
        "CSS",
        "JavaScript",
        "Adobe InDesign",
        "Adobe Photoshop",
        "Adobe Illustrator",
        "Adobe Dreamweaver"
      ],
      "skill_acquired": [
        "Programming",
        "Communication",
        "Critical Thinking",
        "Design Thinking"
      ],
      "images": [
        "image link",
        "image link"
      ]
    },

    {
      "duration": "October 2016 – February 2016",
      "job_title": "Head of Publicity & Digital Marketing",
      "company": "Student Entreperneur division, Universiti Malaysia Sarawak",
      "activities": [
        "Responsible for creating strategic planning for the event.",
        "Responsible for making sure all the team members get a suitable task according to their expertise.",
        "Responsible for making sure all team members give weekly reports.",
        "Responsible for attending weekly and monthly meetings with top management and other departments to get updated information."
      ],
      "achievements": [
        "Successfully invited top businessmen in Sarawak to share about entrepreneurship.",
        "Managed to get more than 15,000 crowds to attend the event.",
        "Successfully Manage to handle team conflict and delegate task for each team members"
      ],
      "tech_stack_used": [
        "Microsoft Excel",
        "Adobe After Effect"
      ],
      "skill_acquired": [
        "Management",
        "Creative Thinking",
        "Critical Thinking",
        "Lead",
        "Business mindset"
      ],
      "images": [
        "image link",
        "image link"
      ]
    },

    {
      "duration": "April 2018 – Julai 2018",
      "job_title": "Lead Developer",
      "company": "Ministry of Education Malaysia & ASEAN Schools Games 2018",
      "activities": [
        "Responsible for designing the UIX ASEAN Schools Games website.",
        "Present the strategic planning in front of the directors, officers, and related ministries.",
        "Responsible to interview and choose officer that will be placed in team IT.",
        "Responsible for delegating the tasks among team members and monitoring each task update.",
        "Responsible for working closely with MAMPU regarding Server and DNS.",
        "Responsible to make sure the website can be accessed without having problems.",
        "Responsible for making sure all the information is updated and the competition results are shown in real time.",
        "Responsible to make sure the support team replies to each ticket that was received from the website.",
        "Responsible for making sure website security levels are at the maximum level."
      ],
      "achievements": [
        "Successfully make ASEAN Schools Games can be accessed from other countries without having long load time.",
        "Manage to get recognition from the media because of how easy to get the information on the website.",
        "Manage to fix the Sport Center Management System before the due date."
      ],
      "tech_stack_used": [
        "WordPress",
        "PHP",
        "HTML",
        "CSS",
        "MySQL",
        "JSON",
        "Linux Shared Hosting",
        "CloudFlare",
        "Tawk.to API"
      ],
      "skill_acquired": [
        "Management",
        "Creative Thinking",
        "Critical Thinking",
        "Leading the team",
        "Conflict Management",
        "Negotiation"
      ],
      "images": [
        "image link",
        "image link"
      ]
    },

    {
      "duration": "August 2018 – December 2018",
      "job_title": "WordPress Developer",
      "company": "Cepat Funnels Marketing Agency",
      "activities": [
        "Responsible for designing new UIX for the company website and system structure.",
        "Responsible for creating a strategic plan to make sure the website can be accessed without having problems such as slow load time, errors, and images not loading properly.",
        "Responsible for registering new domains, deploying a new server, and control panel, and creating a wildcard DNS, and wildcard SSL for the system.",
        "Responsible for developing company systems using Bootstrap UI Framework and WordPress.",
        "Responsible for designing templates for the customer landing page.",
        "Responsible for designing database structure (SaaS, Multi-Tenant)",
        "Develop a custom function to fit the company's request.",
        "Server configuration and responsible for optimizing all the files in the website including image compression and minified the code."
      ],
      "achievements": [
        "Successfully developed a WordPress Multisite with the sub-domain, Multi-tenant Databases Structure, Domain Mapping, Wildcard SSL functions, and many more.",
        "Successfully developed a custom function that enables plugins and themes to work with WordPress Multisite."
      ],
      "tech_stack_used": [
        "WordPress",
        "Custom Theme Development",
        "Custom Plugin Development",
        "PHP",
        "HTML",
        "CSS",
        "JavaScript",
        "MySQL",
        "Digital Ocean VPS",
        "CloudFlare",
        "RunCloud CI/CD"
      ],
      "skill_acquired": [
        "Programming",
        "Business mindset",
        "Creative Thinking",
        "Critical Thinking",
        "Conflict Management",
        "Negotiation",
        "Cost Management"
      ],
      "images": [
        "image link",
        "image link"
      ]
    }
  ]
}
